# Pinterest Technical Interview Question

Given a dataframe like the one below, scale each value by the first occerrance of the same device in the table.

In [62]:
data = {'date':['2014-01-02','2014-01-16','2014-01-07','2014-05-02','2014-02-02',],
'device':['iphone','android','desktop','iphone','android'],
'val':[1000,1500,1050,1010,1200]}

In [63]:
import pandas as pd

In [64]:
df = pd.DataFrame(data)
df['date'] = pd.to_datetime(df['date'])
df = df.sort_values(by='date')
df

        date   device   val
0 2014-01-02   iphone  1000
2 2014-01-07  desktop  1050
1 2014-01-16  android  1500
4 2014-02-02  android  1200
3 2014-05-02   iphone  1010

In [65]:
min_date_df = df.groupby('device').date.min().reset_index()
min_date_df

    device       date
0  android 2014-01-16
1  desktop 2014-01-07
2   iphone 2014-01-02

In [66]:
scale_val_df = df.merge(min_date_df,on=['device','date'])
scale_val_df

        date   device   val
0 2014-01-02   iphone  1000
1 2014-01-07  desktop  1050
2 2014-01-16  android  1500

In [67]:
combined_df = df.merge(scale_val_df, how='left',on=['device'] ).drop(columns=['date_y'])

In [68]:
combined_df['scaled'] = combined_df['val_x']/combined_df['val_y']

In [70]:
combined_df.drop(columns = 'val_y')

      date_x   device  val_x  scaled
0 2014-01-02   iphone   1000    1.00
1 2014-01-07  desktop   1050    1.00
2 2014-01-16  android   1500    1.00
3 2014-02-02  android   1200    0.80
4 2014-05-02   iphone   1010    1.01